examples/openfoam/example_icoFoamYade/0_org/p

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    y1
    {
        type            zeroGradient;
    }


    y0
    {
        type            zeroGradient;
    }

    x0
    {
        type            cyclic;
    }


    x1
    {
        type            cyclic;
    }


    z0
    {
        type            cyclic;
    }



    z1
    {
        type            cyclic;
    }


}

// ************************************************************************* //
